renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssi_api_rx.c
/*******************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only 
* intended for use with Renesas products. No other uses are authorized. This 
* software is owned by Renesas Electronics Corporation and is protected under
* all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT
* LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE 
* AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS 
* ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE 
* FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR
* ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software
* and to discontinue the availability of this software. By using this software,
* you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2014-2019 Renesas Electronics Corporation. All rights reserved.    
*******************************************************************************/
/******************************************************************************
* File Name    : r_ssi_api_rx.c
* Version      : 1.24
* Device       : RX64M, RX71M, RX113, RX231, RX230, RX23W
* Tool-Chain   : RX Family C Compiler
*                GCC for Renesas RX
*                IAR C/C++ Compiler for Renesas RX
* Description  : SSI driver module file for RX MCUs.
*******************************************************************************
* History : DD.MM.YYYY  Version  Description
*         : 01.08.2014   1.00     First release.
*         : 03.12.2014   1.10     Change flag access operations.
*                                 And add flag access functions
*                                 for TDE, RDF, TUIRQ, TOIRQ, RUIRQ, ROIRQ.
*         : 11.12.2014   1.11     RX71M support added.
*         : 28.04.2015   1.20     RX113, RX231, RX230 support added.
*         : 07.04.2017   1.21     Version number updated.
*         : 01.02.2019   1.22     Changed Minor version to 1.22.
*         : 20.05.2019   1.23     Added support for the GCC and IAR compiler.
*         : 20.06.2019   1.24     RX23W support added.
*
******************************************************************************/

/******************************************************************************
Includes   <System Includes> , "Project Includes"
******************************************************************************/
/* Configuration options for the SSI API. This is also included in 
   r_ssi_api_rx.h and would normally not need to be included separately.
   It is included separately here so that the decision can be made to use
   the r_bsp package or not. */
#include "r_ssi_api_rx_config.h"

/* Function prototypes and device specific info needed for SSI API */
#include "r_ssi_api_rx_if.h"

#if (defined(SSI0) || defined(SSI1))
/* Information needed for SSI API. */
#include "r_ssi_api_rx_private.h"

/******************************************************************************
Macro definitions
******************************************************************************/
#define SSI_FIFONUM2    (2u) /* Operator just used for functions in this file. */
#define SSI_CALCNUM2    (2u) /* Operator just used for functions in this file. */
                        
/* time-out count
   How to decide "time-out count".
     Functions R_SSI_Stop() & R_SSI_Mute() wait 2 PCM data in TX FIFO & 
       1 data in shift register to be sent. So totally at least "1/Fs [uSec] x 3" 
       period of time is needed.
     And when Sampling frequency is 8kHz, the time to finish sending all data 
       is the maximum. it is 
       1/(8kHz) x 3 = 375[uSec]. 
     So waiting time must be larger than 375[uSec].
     In case, CPU clock is 120MHz, loop times is maximum.
       1/(120MHz) x 45000 = 375[uSec]
     Adding about 10% margin(5000), total times for loop is 
       1/(120MHz) x (45000 + 5000) = 416[uSec]
     Then, here timeout loop times is configured "50000".
*/ 
#define SSI_TIMEOUT_416USEC         (50000u) /* time-out count */

/* Macro definitions to access status flag bits */
#define SSI_BIT_RDF     (0x00000001)    /* RDF bit location to clear*/
#define SSI_BIT_TDE     (0x00010000)    /* TDE bit location to clear*/
#define SSI_KEEP_RDF    (SSI_BIT_RDF)   /* RDF bit location to mask */
#define SSI_KEEP_TDE    (SSI_BIT_TDE)   /* TDE bit location to mask */
#define SSI_BIT_TUIRQ   (0x20000000)    /* TUIRQ bit location to clear*/
#define SSI_BIT_TOIRQ   (0x10000000)    /* TOIRQ bit location to clear*/
#define SSI_BIT_RUIRQ   (0x08000000)    /* RUIRQ bit location to clear*/
#define SSI_BIT_ROIRQ   (0x04000000)    /* ROIRQ bit location to clear*/
#define SSI_KEEP_TO_RU_RO  (SSI_BIT_TOIRQ | SSI_BIT_RUIRQ | SSI_BIT_ROIRQ) /* TO/RU/ROIRQ bits to mask */
#define SSI_KEEP_TU_RU_RO  (SSI_BIT_TUIRQ | SSI_BIT_RUIRQ | SSI_BIT_ROIRQ) /* TU/RU/ROIRQ bits to mask */
#define SSI_KEEP_TU_TO_RO  (SSI_BIT_TUIRQ | SSI_BIT_TOIRQ | SSI_BIT_ROIRQ) /* TU/TO/ROIRQ bits to mask */
#define SSI_KEEP_TU_TO_RU  (SSI_BIT_TUIRQ | SSI_BIT_TOIRQ | SSI_BIT_RUIRQ) /* TU/TO/RUIRQ bits to mask */

/******************************************************************************
Typedef definitions
******************************************************************************/
/* MSTP parameter  */
typedef enum {
    SSI_MSTP_CLR = 0,
    SSI_MSTP_SET = 1,
} ssi_mstp_t;

/******************************************************************************
Exported global variables 
******************************************************************************/

