renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssi_api_rx.c
/******************************************************************************
Private global variables and functions
******************************************************************************/
/* Tables contain values for local functions */
static const uint32_t r_ssi_get_iomode [] =  /* iomode table*/
{
    SSI_CH0_IO_MODE,
#ifdef SSI1
    SSI_CH1_IO_MODE, /* activates when using MCU with SSI1 */
#endif
};

static const uint32_t r_ssi_get_ssi_address [] = /* SSI0/1 io register address table */
{
    (uint32_t)&SSI0,
#ifdef SSI1 
    (uint32_t)&SSI1, /* activates when using MCU with SSI1 */
#endif
};

/******************************************************************************
* Function Name: r_ssi_down_count
* Description  : is used for time-out operation, decrements "down_count" value
* Arguments    : down_count: a value to be decremented
* Return Value : "down_count" value after decement
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_down_count)
uint16_t r_ssi_down_count ( uint32_t down_count )
{
    if ( down_count > 0u )
    {
        down_count--;
    }
    else
    {
        /* Do nothing. */
    }
    return down_count;
} /* End of Function r_ssi_down_count */

/******************************************************************************
* Function Name: r_ssi_clear_flag_tde
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSI0 or SSI1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_tde)
void r_ssi_clear_flag_tde ( volatile struct st_ssi R_SSI_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssifsr = p_ssi_reg->SSIFSR.LONG;  /* get SSIFSR */

    ssifsr &= (~SSI_BIT_TDE);                 /* clear TDE to 0 */
    ssifsr |= SSI_KEEP_RDF;                   /* keep RDF value */
    p_ssi_reg->SSIFSR.LONG = ssifsr;           /* update SSIFSR */
} /* End of Function r_ssi_clear_flag_tde */

/******************************************************************************
* Function Name: r_ssi_clear_flag_rdf
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSI0 or SSI1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_rdf)
void r_ssi_clear_flag_rdf ( volatile struct st_ssi R_SSI_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssifsr = p_ssi_reg->SSIFSR.LONG;  /* get SSIFSR */

    ssifsr &= (~SSI_BIT_RDF);                 /* clear RDF to 0 */
    ssifsr |= SSI_KEEP_TDE;                   /* keep TDE value */
    p_ssi_reg->SSIFSR.LONG = ssifsr;           /* update SSIFSR */
} /* End of Function r_ssi_clear_flag_rdf */

/******************************************************************************
* Function Name: r_ssi_clear_flag_tuirq
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSI0 or SSI1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_tuirq)
void r_ssi_clear_flag_tuirq ( volatile struct st_ssi R_SSI_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssisr = p_ssi_reg->SSISR.LONG;  /* get SSISR */

    ssisr &= (~SSI_BIT_TUIRQ);              /* clear TUIRQ to 0 */
    ssisr |= SSI_KEEP_TO_RU_RO;             /* keep TO/RU/ROIRQ value */
    p_ssi_reg->SSISR.LONG = ssisr;           /* update SSISR */
} /* End of Function r_ssi_clear_flag_tuirq */

/******************************************************************************
* Function Name: r_ssi_clear_flag_toirq
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSI0 or SSI1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_toirq)
void r_ssi_clear_flag_toirq ( volatile struct st_ssi R_SSI_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssisr = p_ssi_reg->SSISR.LONG;  /* get SSISR */

    ssisr &= (~SSI_BIT_TOIRQ);              /* clear TOIRQ to 0 */
    ssisr |= SSI_KEEP_TU_RU_RO;             /* keep TU/RU/ROIRQ value */
    p_ssi_reg->SSISR.LONG = ssisr;           /* update SSISR */
} /* End of Function r_ssi_clear_flag_toirq */

/******************************************************************************
* Function Name: r_ssi_clear_flag_ruirq
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSI0 or SSI1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_ruirq)
void r_ssi_clear_flag_ruirq ( volatile struct st_ssi R_SSI_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssisr = p_ssi_reg->SSISR.LONG;  /* get SSISR */

    ssisr &= (~SSI_BIT_RUIRQ);              /* clear RUIRQ to 0 */
    ssisr |= SSI_KEEP_TU_TO_RO;             /* keep TU/TO/ROIRQ value */
    p_ssi_reg->SSISR.LONG = ssisr;           /* update SSISR */
} /* End of Function r_ssi_clear_flag_ruirq */

/******************************************************************************
* Function Name: r_ssi_clear_flag_roirq
* Description  : clears TDE bit of io register
* Arguments    : p_ssi_reg: SSI0 or SSI1 io register address
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_clear_flag_roirq)
void r_ssi_clear_flag_roirq ( volatile struct st_ssi R_SSI_EVENACCESS * p_ssi_reg )
{   
    uint32_t ssisr = p_ssi_reg->SSISR.LONG;  /* get SSISR */

    ssisr &= (~SSI_BIT_ROIRQ);              /* clear ROIRQ to 0 */
    ssisr |= SSI_KEEP_TU_TO_RU;             /* keep TU/TO/RUIRQ value */
    p_ssi_reg->SSISR.LONG = ssisr;           /* update SSISR */
} /* End of Function r_ssi_clear_flag_roirq */

/******************************************************************************
* Function Name: r_ssi_module_stop
* Description  : 
* Arguments    : p_ssi_reg: SSI0 or SSI1 io register address
*                ssi_mstp : activate or deactivate module stop
* Return Value : none
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_module_stop)
void r_ssi_module_stop (const ssi_ch_t Channel, const ssi_mstp_t ssi_mstp)
{
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
	bsp_int_ctrl_t int_ctrl;
#endif

    R_BSP_RegisterProtectDisable(BSP_REG_PROTECT_LPC_CGC_SWR);

#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_DISABLE, &int_ctrl);
#endif

    switch (Channel)
    {
        case SSI_CH0:
            MSTP(SSI0) = ssi_mstp;
        break;

