renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssi_api_rx.c
#ifdef SSI1 /* activates when using MCU with SSI1 */
        case SSI_CH1:
            MSTP(SSI1) = ssi_mstp;
        break;
#endif
        default:
            ; /* no operation */
        break;
    }
#if ((R_BSP_VERSION_MAJOR == 5) && (R_BSP_VERSION_MINOR >= 30)) || (R_BSP_VERSION_MAJOR >= 6)
    R_BSP_InterruptControl(BSP_INT_SRC_EMPTY, BSP_INT_CMD_FIT_INTERRUPT_ENABLE, &int_ctrl);
#endif

    R_BSP_RegisterProtectEnable(BSP_REG_PROTECT_LPC_CGC_SWR);
} /* End of Function  */

/******************************************************************************
* Function Name: r_ssi_check_param
* Description  : 
* Arguments    : const ssi_ch_t Channel     : [I] Channel Number of SSI
* Return Value : return value defined in enum ssi_ret_t
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_check_param)
ssi_ret_t r_ssi_check_param (const ssi_ch_t Channel)
{
    ssi_ret_t ret = SSI_SUCCESS;

    switch (Channel)
    {
        case SSI_CH0:
            if (true == R_BSP_HardwareLock(BSP_LOCK_SSI0))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSI0);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#ifdef SSI1 /* activates when using MCU with SSI1 */
        case SSI_CH1:
            if (true == R_BSP_HardwareLock(BSP_LOCK_SSI1))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSI1);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#endif
        default:
            ret = SSI_ERR_PARAM;
        break;
    }

    return ret;
} /* End of Function r_ssi_check_param */

/******************************************************************************
* Function Name: r_ssi_check_param_buf
* Description  : 
* Arguments    : const ssi_ch_t Channel     : [I] Channel Number of SSI
*              : const void * pBuf          : [I/O] Pointer to Output Buffer
*              : const uint8_t Samples      : [I] Number of samples to write 
* Return Value : return value defined in enum ssi_ret_t
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_check_param_buf)
ssi_ret_t r_ssi_check_param_buf (const ssi_ch_t Channel,
                                 const  void * pBuf,
                                 const  uint8_t Samples)
{
    ssi_ret_t ret = SSI_SUCCESS;

    switch (Channel)
    {
        case SSI_CH0:
            if (((uint32_t *)FIT_NO_PTR == pBuf) || (0 == Samples))
            {
                ret = SSI_ERR_PARAM;
                break;
            }

            if (true == R_BSP_HardwareLock(BSP_LOCK_SSI0))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSI0);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#ifdef SSI1 /* activates when using MCU with SSI1 */
        case SSI_CH1:
            if (((uint32_t *)FIT_NO_PTR == pBuf) || (0 == Samples))
            {
                ret = SSI_ERR_PARAM;
                break;
            }

            if (true == R_BSP_HardwareLock(BSP_LOCK_SSI1))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSI1);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#endif
        default:
            ret = SSI_ERR_PARAM;
        break;
    }

    return ret;
} /* End of Function r_ssi_check_param_buf */

/******************************************************************************
* Function Name: r_ssi_check_param_mute
* Description  : 
* Arguments    : const ssi_ch_t Channel      : [I] Channel Number of SSI
*              : const ssi_mute_t OnOff      : [I] Mute ON/OFF Switch
* Return Value : return value defined in enum ssi_ret_t
******************************************************************************/
R_BSP_PRAGMA_STATIC_INLINE(r_ssi_check_param_mute)
ssi_ret_t r_ssi_check_param_mute (const ssi_ch_t Channel,
                                  const  ssi_mute_t OnOff)
{
    ssi_ret_t ret = SSI_SUCCESS;

    switch (Channel)
    {
        case SSI_CH0:

        	/* The following code occurs a compilation warning but does not affect actual operation. */
        	if ((SSI_MUTE_ON > OnOff) || (SSI_MUTE_OFF < OnOff))
            {
                ret = SSI_ERR_PARAM;
                break;
            }

            if (true == R_BSP_HardwareLock(BSP_LOCK_SSI0))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSI0);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#ifdef SSI1 /* activates when using MCU with SSI1 */
        case SSI_CH1:

        	/* The following code occurs a compilation warning but does not affect actual operation. */
        	if ((SSI_MUTE_ON > OnOff) || (SSI_MUTE_OFF < OnOff))
            {
                ret = SSI_ERR_PARAM;
                break;
            }

            if (true == R_BSP_HardwareLock(BSP_LOCK_SSI1))
            {
                (void)R_BSP_HardwareUnlock(BSP_LOCK_SSI1);
                ret = SSI_ERR_CHANNEL;
            }
        break;

#endif
        default:
            ret = SSI_ERR_PARAM;
        break;
    }

    return ret;
} /* End of Function r_ssi_check_param_mute */

/**********************************************************************************************************************
 * Function Name: R_SSI_Open
 ******************************************************************************************************************//**
 * @brief Locks to keep a specified SSI channel and initializes it corresponding to r_ssi_api_rx_config.h.
 * @param[in] Channel It specifies an SSI channel to lock. Choose one enumerator member from the enumerator typedef
 * ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, the specified SSI channel is configured.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel can't be locked.
 * @retval SSI_ERR_EXCEPT Not successful, the specified SSI channel is in unwanted hardware condition.
 * @details Call this function certainly once before starting to use a specified SSI channel individually.
 * @note -
 */
ssi_ret_t R_SSI_Open ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;

