renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssi_api_rx.c
    /* parameter check operation */
    switch (Channel)
    {
        case SSI_CH0:
            if (false == R_BSP_HardwareLock(BSP_LOCK_SSI0))
            {
                ret = SSI_ERR_CHANNEL;
            }
        break;

#ifdef SSI1 /* activates when using MCU with SSI1 */
        case SSI_CH1:
            if (false == R_BSP_HardwareLock(BSP_LOCK_SSI1))
            {
                ret = SSI_ERR_CHANNEL;
            }
        break;

#endif
        default:
            ret = SSI_ERR_PARAM;
        break;
    }

    if ( SSI_SUCCESS == ret )
    {
        uint32_t ssifcr;
        uint32_t ssicr;
        volatile struct st_ssi R_SSI_EVENACCESS *p_ssi_reg;

        /* logical operation to make value to set ssi register  */
        switch (Channel)
        {
            case SSI_CH0:
                ssifcr = ((SSI_CH0_AUCKE << SSI_AUCKE_SHIFT) |
                            (SSI_CH0_TTRG << SSI_TTRG_SHIFT) |
                            (SSI_CH0_RTRG << SSI_RTRG_SHIFT));
                ssicr = ((SSI_CH0_CKDV << SSI_CKDV_SHIFT) |   
                           (SSI_CH0_DEL << SSI_DEL_SHIFT) |
                           (SSI_CH0_PDTA << SSI_PDTA_SHIFT) |
                           (SSI_CH0_SDTA << SSI_SDTA_SHIFT) |
                           (SSI_CH0_SPDP << SSI_SPDP_SHIFT) |
                           (SSI_CH0_SWSP << SSI_SWSP_SHIFT) |
                           (SSI_CH0_SCKP << SSI_SCKP_SHIFT) |
                           (SSI_CH0_SWSD << SSI_SWSD_SHIFT) |
                           (SSI_CH0_SCKD << SSI_SCKD_SHIFT) |
                           (SSI_CH0_SWL << SSI_SWL_SHIFT) |
                           (SSI_CH0_DWL << SSI_DWL_SHIFT));
                p_ssi_reg = &(SSI0);
            break;

#ifdef SSI1 /* activates when using MCU with SSI1 */
            case SSI_CH1:
                ssifcr = ((SSI_CH1_AUCKE << SSI_AUCKE_SHIFT) |
                           (SSI_CH1_TTRG << SSI_TTRG_SHIFT) |
                           (SSI_CH1_RTRG << SSI_RTRG_SHIFT));
                ssicr = ((SSI_CH1_CKDV << SSI_CKDV_SHIFT) |
                          (SSI_CH1_DEL << SSI_DEL_SHIFT) |
                          (SSI_CH1_PDTA << SSI_PDTA_SHIFT) |
                          (SSI_CH1_SDTA << SSI_SDTA_SHIFT) |
                          (SSI_CH1_SPDP << SSI_SPDP_SHIFT) |
                          (SSI_CH1_SWSP << SSI_SWSP_SHIFT) |
                          (SSI_CH1_SCKP << SSI_SCKP_SHIFT) |
                          (SSI_CH1_SWSD << SSI_SWSD_SHIFT) |
                          (SSI_CH1_SCKD << SSI_SCKD_SHIFT) |
                          (SSI_CH1_SWL << SSI_SWL_SHIFT) |
                          (SSI_CH1_DWL << SSI_DWL_SHIFT));
                p_ssi_reg = &(SSI1);  
            break;
                
#endif
            default:
                /* no operation */
            break;
        }
        
        /* Open operation mainbody */
        r_ssi_module_stop (Channel, SSI_MSTP_CLR);

        /* open operation */
        if ( SSI_SSISR_TSWNO_ON == p_ssi_reg->SSISR.BIT.TSWNO )
        {
            uint32_t timeout;

            /* reset SSI peripheral */
            timeout = SSI_TIMEOUT_416USEC; /* initializes timeout counter. */
            p_ssi_reg->SSIFCR.BIT.SSIRST = 1; /* sets SSIRST bit to "1" */

            /* WAIT_LOOP */
            while( 1 != p_ssi_reg->SSIFCR.BIT.SSIRST ) /* waits till SSIRST to be "1" */
            {
                /* Check loop count to detect abnormal condition. */
                timeout = r_ssi_down_count ( timeout );
                if ( 0 == timeout )
                {
                    ret = SSI_ERR_EXCEPT; /* returns abnormal condition. */
                    break;
                }
            }

            timeout = SSI_TIMEOUT_416USEC; /* initializes timeout counter. */
            p_ssi_reg->SSIFCR.BIT.SSIRST = 0; /* clears SSIRST bit to "0" */

            /* WAIT_LOOP */
            while( 0 != p_ssi_reg->SSIFCR.BIT.SSIRST ) /* waits till SSIRST to be "0" */
            {
                /* Check loop count to detect abnormal condition. */
                timeout = r_ssi_down_count ( timeout );
                if ( 0 == timeout )
                {
                    ret = SSI_ERR_EXCEPT; /* returns abnormal condition. */
                    break;
                }
            }
        }
            
        if ( SSI_SUCCESS == ret)
        {
            /* Set SSIFCR, SSICR register */
            p_ssi_reg->SSIFCR.LONG = 0u;
            p_ssi_reg->SSICR.LONG = 0u;
            p_ssi_reg->SSITDMR.LONG = 0u;
            
            /* Set SSIFCR, SSICR register */
            p_ssi_reg->SSIFCR.LONG |= ssifcr;
            p_ssi_reg->SSICR.LONG |= ssicr;
        }
    }

    return ret;
}

/******************************************************************************
End of function  R_SSI_Open
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_Start
 ******************************************************************************************************************//**
 * @brief Enables PCM data transmit and/or receive operations for a specified SSI channel.
 * @param[in] Channel It specifies an SSI channel to enable PCM data transmit and/or receive operations. Choose one
 * enumerator member from the enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, PCM data transmit and/or receive operations are enabled for the specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @details Call this function to enable PCM data transmit and/or receive operation with a specified SSI channel.
 * @note -
 */
ssi_ret_t R_SSI_Start ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

