renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssi_api_rx.c
    /* start operation mainbody */
    if (SSI_SUCCESS == ret)  /* parameters are valid. */
    {
        volatile struct st_ssi R_SSI_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssi R_SSI_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        const uint32_t ssisr_iirq = p_ssi_reg->SSISR.BIT.IIRQ;
        uint32_t dummy;         /* valiable for dummy reading to write SSIFSR, SSISR. */

        /* SSI Start operation */
        switch (r_ssi_get_iomode [Channel])
        {
            case SSI_IO_MODE_TX: /* case SSI transmit mode */
                if ((SSI_SSISR_IIRQ_ON == ssisr_iirq) &&
                   (SSI_SSICR_TEN_DISABLE == p_ssi_reg->SSICR.BIT.TEN))
                {
                    uint32_t count;

                    /* Tx FIFO Reset */
                    p_ssi_reg->SSIFCR.BIT.TFRST = SSI_SSIFCR_TFRST_ENABLE;
                    p_ssi_reg->SSIFCR.BIT.TFRST = SSI_SSIFCR_TFRST_DISABLE;
                    
                    /* Tx FIFO Initialize */

                    /* WAIT_LOOP */
                    for (count = 0u; count < SSI_SSIFSR_TDCMAX; count++)
                    {
                        p_ssi_reg->SSIFTDR = 0u;
                    }
                    
                    /* SSIFSR, SSISR Initialize */
                    dummy = p_ssi_reg->SSIFSR.LONG;       /* dummy reading is needed to write SSIFSR. */
                    p_ssi_reg->SSIFSR.LONG = 0u;
                    dummy = p_ssi_reg->SSISR.LONG;        /* dummy reading is needed to write SSISR. */
                    p_ssi_reg->SSISR.LONG = 0u;
                    dummy; /* This code occurs a compilation warning but does not affect actual operation. */
                    
                    /* Setting to start SSI Tx */
                    p_ssi_reg->SSIFCR.BIT.TIE = SSI_SSIFCR_TIE_ENABLE;
                    p_ssi_reg->SSICR.LONG |= ((SSI_SSICR_TUIEN_ENABLE << SSI_TUIEN_SHIFT) |
                                              (SSI_SSICR_TOIEN_ENABLE << SSI_TOIEN_SHIFT) |
                                              (SSI_SSICR_TEN_ENABLE << SSI_TEN_SHIFT));
                }

            break;

            case SSI_IO_MODE_RX: /* case SSI receive mode */
                if ((SSI_SSISR_IIRQ_ON == ssisr_iirq) &&
                (SSI_SSICR_REN_DISABLE == p_ssi_reg->SSICR.BIT.REN))
                {
                    /* Rx FIFO Reset */
                    p_ssi_reg->SSIFCR.BIT.RFRST = SSI_SSIFCR_RFRST_ENABLE;
                    p_ssi_reg->SSIFCR.BIT.RFRST = SSI_SSIFCR_RFRST_DISABLE;
                    
                    /* SSIFSR, SSISR Initialize */
                    dummy = p_ssi_reg->SSIFSR.LONG;       /* dummy reading is needed to write SSIFSR. */
                    p_ssi_reg->SSIFSR.LONG = 0u;
                    dummy = p_ssi_reg->SSISR.LONG;        /* dummy read is needed to write SSISR. */
                    p_ssi_reg->SSISR.LONG = 0u;
                    dummy; /* This code occurs a compilation warning but does not affect actual operation. */
                    
                    /* Setting to start SSI Rx */
                    p_ssi_reg->SSIFCR.BIT.RIE = SSI_SSIFCR_RIE_ENABLE;
                    p_ssi_reg->SSICR.LONG |= ((SSI_SSICR_RUIEN_ENABLE << SSI_RUIEN_SHIFT) |
                                              (SSI_SSICR_ROIEN_ENABLE << SSI_ROIEN_SHIFT) |
                                              (SSI_SSICR_REN_ENABLE));
                }
            break;

            case SSI_IO_MODE_TR: /* case SSI transmit & receive mode */
                if ((SSI_SSISR_IIRQ_ON == ssisr_iirq) &&
                   (SSI_IO_MODE_NONE == (p_ssi_reg->SSICR.LONG & SSI_IO_MODE_TR)))
                {
                     uint32_t count;
                    
                    /* Tx FIFO, Rx FIFO Reset */
                    p_ssi_reg->SSIFCR.LONG |= ((SSI_SSIFCR_TFRST_ENABLE << SSI_TFRST_SHIFT) |
                                               (SSI_SSIFCR_RFRST_ENABLE));
                    p_ssi_reg->SSIFCR.LONG &= ~((SSI_SSIFCR_TFRST_ENABLE << SSI_TFRST_SHIFT) |
                                                (SSI_SSIFCR_RFRST_ENABLE));
                    
                    /* Tx FIFO Initialize */

                    /* WAIT_LOOP */
                    for (count = 0u; count < SSI_SSIFSR_TDCMAX; count++)
                    {
                        p_ssi_reg->SSIFTDR = 0u;
                    }
                    
                    /* SSIFSR, SSISR clear to "0". */
                    dummy = p_ssi_reg->SSIFSR.LONG;       /* dummy reading is needed to write SSIFSR. */
                    p_ssi_reg->SSIFSR.LONG = 0u;
                    dummy = p_ssi_reg->SSISR.LONG;        /* dummy reading is needed to write SSISR. */
                    p_ssi_reg->SSISR.LONG = 0u;
                    dummy; /* This code occurs a compilation warning but does not affect actual operation. */
                    
                    /* Setting to start SSI Tx, Rx */
                    p_ssi_reg->SSIFCR.LONG |= ((SSI_SSIFCR_TIE_ENABLE << SSI_TIE_SHIFT) |
                                               (SSI_SSIFCR_RIE_ENABLE << SSI_RIE_SHIFT));
                    p_ssi_reg->SSICR.LONG |= ((SSI_SSICR_TUIEN_ENABLE << SSI_TUIEN_SHIFT) |
                                              (SSI_SSICR_TOIEN_ENABLE << SSI_TOIEN_SHIFT) |
                                              (SSI_SSICR_RUIEN_ENABLE << SSI_RUIEN_SHIFT) |
                                              (SSI_SSICR_ROIEN_ENABLE << SSI_ROIEN_SHIFT) |
                                              (SSI_SSICR_TEN_ENABLE << SSI_TEN_SHIFT) |
                                              (SSI_SSICR_REN_ENABLE));
                }
            break;

            default:
                ret = SSI_ERR_CHANNEL;
            break;
        }
    }

    return ret;
}
/******************************************************************************
End of function  R_SSI_Start
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_Stop
 ******************************************************************************************************************//**
 * @brief Disables PCM data transmit and/or receive operations for a specified SSI channel.
 * @param[in] Channel It specifies an SSI channel to disable PCM data transmit and/or receive operations. Choose one
 * enumerator member from the enumerator typedef ssi_ch. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, PCM data transmit and/or receive operations are disabled for the specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @retval SSI_ERR_EXCEPT Not successful, the specified SSI channel is in unwanted hardware condition.
 * @details Call this function to disable PCM data transmit and/or receive operation with a specified SSI channel.
 * @note -
 */
ssi_ret_t R_SSI_Stop(const ssi_ch_t Channel)
{
    ssi_ret_t ret = SSI_SUCCESS;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

    /* stop operation mainbody */
    if (SSI_SUCCESS == ret)  /* parameters are valid. */
    {
        uint32_t timeout;
        volatile struct st_ssi R_SSI_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssi R_SSI_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        const uint32_t ssisr_iirq = p_ssi_reg->SSISR.BIT.IIRQ;

        /* SSI Stop operation */
        switch (r_ssi_get_iomode [Channel])
        {
            case SSI_IO_MODE_TX: /* case SSI transmit mode */
                if ((SSI_SSISR_IIRQ_OFF == ssisr_iirq) &&
                    (SSI_SSICR_TEN_ENABLE == p_ssi_reg->SSICR.BIT.TEN))
                {
                    /* procedure to disable SSI transmit operation. */
                    p_ssi_reg->SSICR.LONG &= ~((SSI_SSICR_TUIEN_ENABLE << SSI_TUIEN_SHIFT) |
                                               (SSI_SSICR_TOIEN_ENABLE << SSI_TOIEN_SHIFT));
                    p_ssi_reg->SSIFCR.BIT.TIE = SSI_SSIFCR_TIE_DISABLE;
                    
                    /* wait until Tx FIFO to be more than two empties. */
                    /* initialize timeout counter. */
                    timeout = SSI_TIMEOUT_416USEC; 

                    /* WAIT_LOOP */
                    while (p_ssi_reg->SSIFSR.BIT.TDC >= SSI_SSIFSR_TDC7)
                    {
                        timeout = r_ssi_down_count ( timeout );
                        if ( 0u == timeout )
                        { 
                            /* Return from abnormal condition. */
                            ret = SSI_ERR_EXCEPT;
                            break;
                        }
                    }
                    
                    if (ret != SSI_ERR_EXCEPT)
                    {
                        /* Write "0" to Tx FIFO. It requires to write 8 bytes to Tx FIFO. */
                        p_ssi_reg->SSIFTDR = 0u;
                        p_ssi_reg->SSIFTDR = 0u;

                        /* wait until Tx FIFO becomes the underflow. */
                        /* initialize timeout counter. */
                        timeout = SSI_TIMEOUT_416USEC;

                        /* WAIT_LOOP */
                        while (SSI_SSISR_TUIRQ_OFF == p_ssi_reg->SSISR.BIT.TUIRQ)
                        {
                            /* Check loop count to detect abnormal condition. */
                            timeout = r_ssi_down_count ( timeout );
                            if ( 0u == timeout )
                            { 
                                /* Return from abnormal condition. */
                                ret = SSI_ERR_EXCEPT;
                                break;
                            }
                        }
                    }

                    /* disable SSI transmit operation  */
                    p_ssi_reg->SSICR.BIT.TEN = SSI_SSICR_TEN_DISABLE;
                    r_ssi_clear_flag_tuirq( p_ssi_reg );

