renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssi_api_rx.c
                    /* check TSWNO to judge it abnormal condition or not. */
                    if ( SSI_SSISR_TSWNO_ON == p_ssi_reg->SSISR.BIT.TSWNO )
                    {
                        ret = SSI_ERR_EXCEPT;
                    }
                }
                else
                {
                    /* Exception Error */
                    p_ssi_reg->SSICR.BIT.TEN = SSI_SSICR_TEN_DISABLE;
                    ret = SSI_ERR_EXCEPT;
                }
            break;

            case SSI_IO_MODE_RX: /* case SSI receive mode */

                /* disable SSI receive operation. */
                p_ssi_reg->SSICR.LONG &= ~((SSI_SSICR_RUIEN_ENABLE << SSI_RUIEN_SHIFT) |
                                           (SSI_SSICR_ROIEN_ENABLE << SSI_ROIEN_SHIFT) |
                                           (SSI_SSICR_REN_ENABLE));

                /* disable SSI receive operation  */
                p_ssi_reg->SSIFCR.BIT.RIE = SSI_SSIFCR_RIE_DISABLE;
            break;

            case SSI_IO_MODE_TR: /* case SSI transmit & receive mode */
                if ((SSI_SSISR_IIRQ_OFF == ssisr_iirq) &&
                    (SSI_IO_MODE_TR == (p_ssi_reg->SSICR.LONG & SSI_IO_MODE_TR)))
                {
                    /* Procedure to disable SSI transmit operation. 
                       Receive operation is disabled here.
                    */
                    p_ssi_reg->SSICR.LONG &= ~((SSI_SSICR_TUIEN_ENABLE << SSI_TUIEN_SHIFT) |
                                               (SSI_SSICR_TOIEN_ENABLE << SSI_TOIEN_SHIFT) |
                                               (SSI_SSICR_RUIEN_ENABLE << SSI_RUIEN_SHIFT) |
                                               (SSI_SSICR_ROIEN_ENABLE << SSI_ROIEN_SHIFT) |
                                               (SSI_SSICR_REN_ENABLE));
                    p_ssi_reg->SSIFCR.LONG &= ~((SSI_SSIFCR_TIE_ENABLE << SSI_TIE_SHIFT) |
                                                (SSI_SSIFCR_RIE_ENABLE << SSI_RIE_SHIFT));
                    
                    /* wait until Tx FIFO to be more than two empties. */
                    /* initialize timeout counter. */
                    timeout = SSI_TIMEOUT_416USEC; 

                    /* WAIT_LOOP */
                    while (p_ssi_reg->SSIFSR.BIT.TDC >= SSI_SSIFSR_TDC7)
                    {
                        /* Check loop count to detect abnormal condition. */
                        timeout = r_ssi_down_count ( timeout );
                        if ( 0u == timeout )
                        {
                            /* Return from abnormal condition. */
                            ret = SSI_ERR_EXCEPT;
                            break;
                        }
                    }
                    
                    if (ret != SSI_ERR_EXCEPT)
                    {
                        /* write data "0" in Tx FIFO */
                        p_ssi_reg->SSIFTDR = 0u;
                        p_ssi_reg->SSIFTDR = 0u;

                        /* wait until Tx FIFO becomes the underflow */
                        /* initialize timeout counter. */
                        timeout = SSI_TIMEOUT_416USEC; 

                        /* WAIT_LOOP */
                        while (SSI_SSISR_TUIRQ_OFF == p_ssi_reg->SSISR.BIT.TUIRQ)
                        {
                            /* Check loop count to detect abnormal condition. */
                            timeout = r_ssi_down_count ( timeout );
                            if ( 0 == timeout )
                            { 
                                /* Return from abnormal condition. */
                                ret = SSI_ERR_EXCEPT;
                                break;
                            }
                        }
                    }

                    /* disable SSI transmit operation  */
                    p_ssi_reg->SSICR.BIT.TEN = SSI_SSICR_TEN_DISABLE;
                    r_ssi_clear_flag_tuirq( p_ssi_reg );

                    /* check TSWNO to judge it abnormal condition or not. */
                    if ( SSI_SSISR_TSWNO_ON == p_ssi_reg->SSISR.BIT.TSWNO )
                    {
                        ret = SSI_ERR_EXCEPT;
                    }
                }
                else
                {
                    /* Exception Error */
                    p_ssi_reg->SSICR.LONG &= ~((SSI_SSICR_TEN_ENABLE << SSI_TEN_SHIFT) |
                                               (SSI_SSICR_REN_ENABLE)); /* execution order doesn't affect result */
                    ret = SSI_ERR_EXCEPT;
                }
            break;

            default:
                ret = SSI_ERR_CHANNEL;
            break;
        }

        /* Wait operation for IIRQ to be set. */
        if ( ret == SSI_SUCCESS )
        {
            /* Wait until Idle mode Interrrupt status Flag to be set. */
            /* initialize timeout counter. */
            timeout = SSI_TIMEOUT_416USEC;

            /* WAIT_LOOP */
            while ( SSI_SSISR_IIRQ_OFF == p_ssi_reg->SSISR.BIT.IIRQ )
            {
                /* Check loop count to detect abnormal condition. */
                timeout = r_ssi_down_count ( timeout );
                if ( 0u == timeout )
                { 
                    /* Return from abnormal condition. */
                    ret = SSI_ERR_EXCEPT;
                    break;
                }
            }
        }
    }

   return ret;
}
/******************************************************************************
End of function  R_SSI_Stop
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_Close
 ******************************************************************************************************************//**
 * @brief Unlocks to release a specified SSI channel.
 * @param[in] Channel It specifies an SSI channel to release. Choose one enumerator member from the enumerator typedef
 * ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, the specified SSI channel is released.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel can't be unlocked or has not been locked.
 * @details Call this function when finish to use a specified SSI channel.
 * @note -
 */
ssi_ret_t R_SSI_Close(const ssi_ch_t Channel)
{
    ssi_ret_t ret = SSI_SUCCESS;
    uint32_t dummy;         /* valiable for dummy reading to write SSIFSR, SSISR. */

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

    if (SSI_SUCCESS == ret)  /* parameters are valid. */
    {
        volatile struct st_ssi R_SSI_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssi R_SSI_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        /* Close operation mainbody */
        { 
            /* case: hardware is locked. */
            const uint32_t ssisr_iirq = p_ssi_reg->SSISR.BIT.IIRQ;

            if ((SSI_SSISR_IIRQ_OFF == ssisr_iirq) &&
               ((p_ssi_reg->SSICR.LONG & SSI_IO_MODE_TR) != SSI_IO_MODE_NONE))
            {
                ret = SSI_ERR_CHANNEL;
            }
            else
            {
                /*  'Set reset value to registers. 
                    'This operation sets AUCKE disabled.
                    'Clear operation for FIFOs is not executed,
                       because FIFOs are filled with "0" after R_SSI_Stop()
                       operation at this moment. So that FIFO underflow & 
                       overflow will not be arisen.
                */
                /* turn registers to default value */
                p_ssi_reg->SSIFCR.LONG = 0u;
                p_ssi_reg->SSICR.LONG = 0u;
                p_ssi_reg->SSITDMR.LONG = 0u;
                dummy = p_ssi_reg->SSIFSR.LONG;
                p_ssi_reg->SSIFSR.LONG = 0u;
                dummy = p_ssi_reg->SSISR.LONG;
                p_ssi_reg->SSISR.LONG = SSI_SSISR_RESET_VALUE;
                dummy; /* This code occurs a compilation warning but does not affect actual operation. */

                /* Stop feeding clock to SSI peripheral to deactivate it. */
                r_ssi_module_stop (Channel, SSI_MSTP_SET);

                switch (Channel)
                {

