renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssi_api_rx.c
    /* parameter check operation */
    ret = r_ssi_check_param_buf (Channel, pBuf, Samples);

    /* read operation mainbody */
    if (SSI_SUCCESS == ret)  /* parameters are valid. */
    {
        volatile struct st_ssi R_SSI_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssi R_SSI_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        if (SSI_IO_MODE_TX == r_ssi_get_iomode [Channel])
        {
            ret = SSI_ERR_CHANNEL;
        }
        else
        {
            uint32_t fifo_filled;   /* holds the number of filled memory in Rx FIFO */
            uint32_t request;       /* holds the number of times to read-access by request.*/
            uint32_t limit;         /* holds the number of times to read-access to Rx FIFO. */
            uint32_t count = 0u;   /* The number of times Tx FIFO was accessed. */
                
            /* Process to read PCM data from Rx FIFO */
            /* Get the number of filled memory in Rx FIFO. */
            fifo_filled = p_ssi_reg->SSIFSR.BIT.RDC;
            if (0u == fifo_filled)
            {
                /* return because Rx FIFO is empty. */
                ret = 0u;
            }
            else
            {
                /* Calculate time to read-access just corresponding to the "Samples". */
                if (SSI_SSICR_DWL08 == p_ssi_reg->SSICR.BIT.DWL)
                {
                    /* Casting "Samples" to uint32_t is valid because "Samples" is uint8_t
                         and division by SSI_CALCNUM2 is within the uint32_t. */
                    request = ((uint32_t)Samples) / SSI_CALCNUM2;
                }
                else if (SSI_SSICR_DWL16 == (uint32_t)p_ssi_reg->SSICR.BIT.DWL)
                {
                    /* Casting "Samples" to uint32_t is valid because "Samples" is uint8_t. */
                    request = (uint32_t)Samples;
                }
                else
                {
                    /* Casting "Samples" to uint32_t is valid because "Samples" is uint8_t
                         and multiple by SSI_CALCNUM2 is within the uint32_t. */
                    request = ((uint32_t)Samples) * SSI_CALCNUM2;
                }
                
                /* Limit operation for times to read-accecss to Rx FIFO. */
                if (fifo_filled <= request)
                {
                    /* case, the number of filled memory of FIFO is smaller than request. */
                    limit = fifo_filled;
                }
                else
                {
                    /* case, the number of filled memory of FIFO is larger than request. */
                    limit = request;
                }
                
                /*  Read PCM data from Rx FIFO.
                    It is necessary to read 8 bytes as one time.
                */

                /* WAIT_LOOP */
                while ((limit - count) >= SSI_FIFONUM2)
                {
                 /* Casting pBuf to (const uint32_t *) is valid because it just points
                       address on 32 bit address space. */
                    *((uint32_t *)pBuf) = p_ssi_reg->SSIFRDR;
                    pBuf = ((uint32_t *)pBuf) + 1u;
                    *((uint32_t *)pBuf) = p_ssi_reg->SSIFRDR;
                    pBuf = ((uint32_t *)pBuf) + 1u;
                    count += SSI_FIFONUM2;
                }
                
                /* Clear Rx FIFO full flag */
                r_ssi_clear_flag_rdf( p_ssi_reg );
                
                /* Convert the number of FIFO to be plactically read 
                   from Rx FIFO into the number of Samples */
                if (SSI_SSICR_DWL08 == p_ssi_reg->SSICR.BIT.DWL)
                {
                    /* Casting "(count * SSI_CALCNUM2)" to uint8_t is valid because "count" shows
                        times to access to Tx FIFO and the size of Tx FIFO is 8. */
                    ret = (int8_t)(count * SSI_CALCNUM2);
                }
                else if (SSI_SSICR_DWL16 == p_ssi_reg->SSICR.BIT.DWL)
                {
                    /* Casting "count" to uint8_t is valid because "count" shows
                         times to access to Tx FIFO and the size of Tx FIFO is 8. */
                    ret = (int8_t)count;
                }
                else
                {
                    /* Casting "(count / SSI_CALCNUM2)" to uint8_t is valid because "count" shows
                         times to access to Tx FIFO and the size of Tx FIFO is 8. */
                    ret = (int8_t)(count / SSI_CALCNUM2);
                }
            }
        }
    }

    return ret;
}
/******************************************************************************
End of function  R_SSI_Read
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_Mute
 ******************************************************************************************************************//**
 * @brief Sets or releases mute on a specified SSI channel during transmit operation.
 * During mute, the transmitting PCM data of the specified SSI channel is turned 0.
 * @param[in] Channel It specifies an SSI channel to set or release mute. Choose one enumerator member from the
 * enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @param[in] OnOff It specifies to set or release mute. Choose one enumerator member from the enumerator typedef
 * ssi_mute_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, for the specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked. Or the SSI channel
 * is configured for operations other than transmit.
 * @retval SSI_ERR_EXCEPT Not successful, the specified SSI channel is in unwanted hardware condition.
 * @details Call this function to set or release mute for an SSI channel during transmit operation.
 * @note -
 */
ssi_ret_t R_SSI_Mute(const ssi_ch_t Channel, const ssi_mute_t OnOff)
{
    uint32_t timeout;
    ssi_ret_t ret = SSI_SUCCESS;

