renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssi_api_rx.c
    /* parameter check operation */
    ret = r_ssi_check_param_mute (Channel, OnOff);

    /* mute operation mainbody */
    if (SSI_SUCCESS == ret)  /* parameters are valid. */
    {
        volatile struct st_ssi R_SSI_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssi R_SSI_EVENACCESS *)r_ssi_get_ssi_address [Channel];
        
        if (SSI_IO_MODE_TX != r_ssi_get_iomode [Channel])
        {
        /* Error because Mute operation is available only for SSI_IO_MODE_TX. */
            ret = SSI_ERR_CHANNEL;
        }
        else
        {
        /* Start Mute operation. */
            const uint32_t ssifcr_tie = p_ssi_reg->SSIFCR.BIT.TIE;
            const uint32_t ssicr_ten = p_ssi_reg->SSICR.BIT.TEN;
            
            if (SSI_MUTE_ON == OnOff)
            {
                /* Mute on operaton (Mute assertion) */
                if ((SSI_SSIFCR_TIE_ENABLE == ssifcr_tie) && (SSI_SSICR_TEN_ENABLE == ssicr_ten))
                {
                    /* Setting to mute on SSI Tx */
                    p_ssi_reg->SSICR.BIT.TUIEN = SSI_SSICR_TUIEN_DISABLE;
                    p_ssi_reg->SSIFCR.BIT.TIE = SSI_SSIFCR_TIE_DISABLE;
                        
                    /* wait until Tx FIFO to be more than two empties. */

                    /* WAIT_LOOP */
                    while (p_ssi_reg->SSIFSR.BIT.TDC >= SSI_SSIFSR_TDC7)
                    {
                        /* Exception Check */
                        if (SSI_SSISR_IIRQ_ON == p_ssi_reg->SSISR.BIT.IIRQ)
                        {
                            /* Exception Error */
                            ret = SSI_ERR_EXCEPT;
                            break;
                        }
                    }

                    if (ret != SSI_ERR_EXCEPT)
                    {
                        /* Write "0" to Tx FIFO to disable transmit operation.
                           Wait until transmit under flow error arisen.
                           After the error arisen, disable transmit 
                               by TEN = SSI_SSICR_TEN_DISABLE.
                        */
                        p_ssi_reg->SSIFTDR = 0u;
                        p_ssi_reg->SSIFTDR = 0u;

                        /* Set WS Continue Mode to keep WS output */
                        p_ssi_reg->SSITDMR.BIT.CONT = 1u;

                        /* Wait until transmit under flow error flag to be set. */
                        /* initialize timeout counter. */
                        timeout = SSI_TIMEOUT_416USEC;

                        /* WAIT_LOOP */
                        while (SSI_SSISR_TUIRQ_OFF == p_ssi_reg->SSISR.BIT.TUIRQ)
                        {
                            /* Check loop count to detect abnormal condition. */
                            timeout = r_ssi_down_count ( timeout );
                            if ( 0 == timeout )
                            { 
                                /* Return from abnormal condition. */
                                ret = SSI_ERR_EXCEPT;
                                break;
                            }
                        }

                        if (ret != SSI_ERR_EXCEPT)
                        {
                            /* disable SSI transmit operation */
                            p_ssi_reg->SSICR.BIT.TEN = SSI_SSICR_TEN_DISABLE;
                            r_ssi_clear_flag_tuirq( p_ssi_reg );

                            /* check TSWNO to judge it abnormal condition or not. */
                            if ( SSI_SSISR_TSWNO_ON == p_ssi_reg->SSISR.BIT.TSWNO )
                            {
                                ret = SSI_ERR_EXCEPT;
                            }

                            /* Wait operation for IIRQ to be set. */
                            if ( ret == SSI_SUCCESS )
                            {
                                uint32_t timeout;

                                /* Wait until Idle mode Interrrupt status Flag to be set. */
                                /* initialize timeout counter. */
                                timeout = SSI_TIMEOUT_416USEC;

                                /* WAIT_LOOP */
                                while ( SSI_SSISR_IIRQ_OFF == p_ssi_reg->SSISR.BIT.IIRQ )
                                {
                                    /* Check loop count to detect abnormal condition. */
                                    timeout = r_ssi_down_count ( timeout );
                                    if ( 0u == timeout )
                                    { 
                                        /* Return from abnormal condition. */
                                        ret = SSI_ERR_EXCEPT;
                                        break;
                                    }
                                }
                            }
                        }
                    }
                }
            } /* End of Mute on process */
            else
            {
                /* Mute off operaton (Mute deassertion) */
                if ((SSI_SSIFCR_TIE_DISABLE == ssifcr_tie) && (SSI_SSICR_TEN_DISABLE == ssicr_ten))
                {
                    /*  check if Tx FIFO is empty or not */
                    if ( 0u == p_ssi_reg->SSIFSR.BIT.TDC)
                    { 
                        /*  case Tx FIFO is empty:
                            Write "0" to Tx FIFO. It requires to write 8 bytes to Tx FIFO.
                        */
                        p_ssi_reg->SSIFTDR = 0u;
                        p_ssi_reg->SSIFTDR = 0u;

                        /*  Enable transmit operation for Mute off by TEN = SSI_SSICR_TEN_ENABLE,
                            When Mute was turned ON, transmit operation is desabled.
                        */
                        p_ssi_reg->SSICR.BIT.TEN = SSI_SSICR_TEN_ENABLE;

                        /* Wait until Idle mode Interrrupt status Flag to be set. */
                        /* initialize timeout counter. */
                        timeout = SSI_TIMEOUT_416USEC;

                        /* WAIT_LOOP */
                        while ( SSI_SSISR_IIRQ_ON == p_ssi_reg->SSISR.BIT.IIRQ )
                        {
                            /* Check loop count to detect abnormal condition. */
                            timeout = r_ssi_down_count ( timeout );
                            if ( 0 == timeout )
                            {
                                ret = SSI_ERR_EXCEPT;  /* Return from abnormal condition. */
                                break;
                            }
                        }

                        if (ret != SSI_ERR_EXCEPT)
                        {
                            /* Reset WS Continue Mode (it should depend on config.h !!) */
                            p_ssi_reg->SSITDMR.BIT.CONT = 0u;

                            /* Setting to mute off SSI Tx */
                            r_ssi_clear_flag_tde( p_ssi_reg );
                            r_ssi_clear_flag_tuirq( p_ssi_reg );
                            p_ssi_reg->SSIFCR.BIT.TIE = SSI_SSIFCR_TIE_ENABLE;
                            p_ssi_reg->SSICR.BIT.TUIEN = SSI_SSICR_TUIEN_ENABLE;
                        }
                    }
                    else
                    {
                        ret = SSI_ERR_EXCEPT;
                    }
                }
            }
        }
    }

    return ret;
}

