renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_ssi_api_rx/src/r_ssi_api_rx.c
/******************************************************************************
End of function  R_SSI_Mute
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_GetVersion
 ******************************************************************************************************************//**
 * @brief Returns the module version.
 * @return Version number with major and minor version digits packed into a single 32-bit value.
 * @details The function returns the version of this module. The version number is encoded such that the top two bytes
 * are the major version number and the bottom two bytes are the minor version number.
 * @note -
 */
uint32_t R_SSI_GetVersion( void )
{
    uint32_t version_number = 0u;

    /* Bring in major version number. */
    version_number = ((uint16_t)SSI_API_VERSION_MAJOR) << 16u;

    /* Bring in minor version number. */
    version_number |= (uint16_t)SSI_API_VERSION_MINOR;

    return version_number;
}

/******************************************************************************
End of function  R_SSI_GetVersion
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_ClearFlagTxUnderFlow
 ******************************************************************************************************************//**
 * @brief Clears a specified SSI channel's TUIRQ flag of SSISR to 0.
 * @param[in] Channel It specifies an SSI channel to clear the TUIRQ flag. Choose one enumerator member from the
 * enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, this function cleared the TUIRQ flag of the specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @details Call this function to clear the TUIRQ flag when the flag is 1.
 * @note -
 */
ssi_ret_t R_SSI_ClearFlagTxUnderFlow ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

    /* flag clear operation mainbody */
    if ( SSI_SUCCESS == ret )
    {
        volatile struct st_ssi R_SSI_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssi R_SSI_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        /* flag clear operation */
        r_ssi_clear_flag_tuirq(p_ssi_reg);
    }

    return ret;
}

/******************************************************************************
End of function R_SSI_ClearFlagTxUnderFlow
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_ClearFlagTxOverFlow
 ******************************************************************************************************************//**
 * @brief Clears transmitter’s overflow status by setting the TOIRQ flag to 0.
 * @param[in] Channel It specifies an SSI channel to clear the TOIRQ flag. Choose one enumerator member from the
 * enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, this function cleared the TOIRQ flag of the specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @details Call this function to clear the TOIRQ flag when the flag is 1.
 * @note -
 */
ssi_ret_t R_SSI_ClearFlagTxOverFlow ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

    /* flag clear operation mainbody */
    if ( SSI_SUCCESS == ret )
    {
        volatile struct st_ssi R_SSI_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssi R_SSI_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        /* flag clear operation */
        r_ssi_clear_flag_toirq(p_ssi_reg);
    }

    return ret;
}

/******************************************************************************
End of function R_SSI_ClearFlagTxOverFlow
******************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_SSI_ClearFlagRxUnderFlow
 ******************************************************************************************************************//**
 * @brief Clears a specified SSI channel's RUIRQ flag of SSISR to 0.
 * @param[in] Channel It specifies an SSI channel to clear the RUIRQ flag. Choose one enumerator member from the
 * enumerator typedef ssi_ch_t. It is described in file r_ssi_api_rx_if.h.
 * @retval SSI_SUCCESS Successful, this function cleared the RUIRQ flag of the specified SSI channel.
 * @retval SSI_ERR_PARAM Not successful, the parameter is illegal.
 * @retval SSI_ERR_CHANNEL Not successful, the specified SSI channel has not been locked.
 * @details Call this function to clear the RUIRQ flag when the flag is 1.
 * @note -
 */
ssi_ret_t R_SSI_ClearFlagRxUnderFlow ( const ssi_ch_t Channel )
{
    ssi_ret_t ret = SSI_SUCCESS;

    /* parameter & hardware lock checking operation */
    ret = r_ssi_check_param (Channel);

    /* flag clear operation mainbody */
    if ( SSI_SUCCESS == ret )
    {
        volatile struct st_ssi R_SSI_EVENACCESS *p_ssi_reg;

        /* getting ssi register address */
        p_ssi_reg = (volatile struct st_ssi R_SSI_EVENACCESS *)r_ssi_get_ssi_address [Channel];

        /* flag clear operation */
        r_ssi_clear_flag_ruirq(p_ssi_reg);
    }

    return ret;
}

